create database book

create table order(
    id_o int not null primary key,
    bname varchar(60) not null,
    author varchar(15) not null,
    pname varchar(60) not null,
    paddress varchar(60) not null,
    phone varchar(15) not null,
    pcontact varchar(15) not null,
    class varchar(15) not null,
    count int not null,
)

insert into order values(1,"数据库原理","张弎","石家庄在某地出版社","石家庄市裕华区","13037313548","赵华","计算机141",30)
insert into order values(2,"离散数学","张弎","石家庄裕华出版社","石家庄市裕华区","13037313548","赵华","计算机141",30)
insert into order values(3,"数据库应用","李寺","石家庄有一家出版社","石家庄市桥东区","13037314507","钱华","计算机141",30)
insert into order values(4,"数据结构","赵琉","北京市看不见出版社","北京市浦东区","13037315689","周华","计算机141",30)
insert into order values(5,"基础物理学","王吾","石家庄很无聊出版社","石家庄市桥西区","13037310964","李华","计算机171",25)
insert into order values(6,"高等数学","宋琦","上海叫浦东出版社","上海市浦东xin区","13037310096","吴华","计算机171",25)
insert into order values(7,"大学英语一","张弎","石家庄在某地出版社","石家庄市裕华区","13037313548","赵华","计算机171",25)
insert into order values(8,"工程制图","李寺","石家庄有一家出版社","石家庄市桥东区","13037314507","钱华","计算机171",25)
insert into order values(9,"机械结构分析","李寺","石家庄有一家出版社","石家庄市桥东区","13037314507","钱华","机械161",35)
insert into order values(10,"机械制图","周岜","上海文明出版社","上海市浦东区","13033690547","郑华","机械161",35)
insert into order values(11,"离散数学","张弎","石家庄裕华出版社","石家庄市裕华区","13037313548","赵华","网络151",28)
insert into order values(12,"数据结构","杨依","镇江一家出版社","镇江市京口区","13035673378","王华","电子163",34)
insert into order values(13,"古文句法分析","高迩","南京惊涛出版社","南京市浦口区","13003173368","冯华","古文132",20)
insert into order values(14,"中华诗词鉴赏","高迩","南京惊涛出版社","南京市浦口区","13003173368","冯华","古文132",20)
insert into order values(15,"古诗词文化研究分析","高迩","南京惊涛出版社","南京市浦口区","13003173368","冯华","古文141",20)
insert into order values(16,"俄语详解","高迩","南京惊涛出版社","南京市浦口区","13003173368","冯华","古文141",20)
insert into order values(17,"纺织服装设计","支久","石家庄时尚出版社","石家庄市裕华区","13037310006","陈华","纺织141",31)
insert into order values(18,"针织学原理分析","支久","石家庄时尚出版社","石家庄市裕华区","13037310006","陈华","纺织142",21)
insert into order values(19,"时尚潮流前线","支久","石家庄时尚出版社","石家庄市裕华区","13037310006","陈华","服装135",16)
insert into order values(20,"染料分析","苏释","杭州风华出版社","杭州市富阳区","13030367523","褚华","设计144",17)
insert into order values(21,"大学化学基础","箫诗艺","济南人文出版社","济南市槐荫区","13077483506","魏华","高分子141",27)
insert into order values(22,"大学化学基础","箫诗艺","济南人文出版社","济南市槐荫区","13077483506","魏华","金材141",27)
insert into order values(23,"大学化学基础","箫诗艺","济南人文出版社","济南市槐荫区","13077483506","魏华","轻华141",27)
insert into order values(24,"宪法详解","汪轼儿","中华人文出版社","北京市朝阳区","13075467794","蒋华","文法131",20)
insert into order values(25,"刑法分析","汪轼儿","中华人文出版社","北京市朝阳区","13075467794","蒋华","文法131",20)
insert into order values(26,"劳动法","汪轼儿","中华人文出版社","北京市朝阳区","13075467794","蒋华","文法131",20)
insert into order values(27,"电路一","宋琦","上海叫浦东出版社","上海市区","13037310096","吴华","软件146",36)
insert into order values(28,"电路一","宋琦","上海叫浦东出版社","上海市区","13037310096","吴华","网络144",17)